--CREATE DATABASE Library;
--GO

--USE Library;


--CREATE TABLE Students (
--    Id INT NOT NULL IDENTITY (1,1) PRIMARY KEY,
--    FullName NVARCHAR(100) NOT NULL,           
--    GroupName NVARCHAR(50) NOT NULL,           
--    AverageGrade DECIMAL(4,2) NOT NULL,	--максимум 99.99  
--    MinSubjectName NVARCHAR(100) NOT NULL,     
--    MaxSubjectName NVARCHAR(100) NOT NULL      
--);

--INSERT INTO Students (FullName, GroupName, AverageGrade, MinSubjectName, MaxSubjectName) 
--VALUES
--('Иванов Иван Иванович', '101', 88.50, 'Математика', 'Физика'),
--('Петрова Мария Владимировна', '102', 75.00, 'Литература', 'История'),
--('Сидоров Алексей Александрович', '103', 90.25, 'Физика', 'Химия'),
--('Кузнецова Анна Романовна', '101', 85.30, 'Биология', 'География'),
--('Николаев Николай Петрович', '104', 92.75, 'Химия', 'Математика'),
--('Смирнова Ольга Сергеевна', '102', 68.00, 'Литература', 'Экономика'),
--('Попов Сергей Алексеевич', '103', 80.40, 'Информатика', 'Философия'),
--('Федорова Екатерина Игоревна', '101', 95.20, 'Чтение', 'Иностранный язык'),
--('Лебедев Денис Станиславович', '104', 78.45, 'История', 'Русский язык'),
--('Костина Татьяна Николаевна', '102', 82.60, 'Выбор предмета', 'Математика'),
--('Яковлев Кирилл Владиславович', '103', 86.90, 'Физика', 'Литература'),
--('Григорьев Андрей Викторович', '101', 74.10, 'Химия', 'Биология'),
--('Калинина Анастасия Вячеславовна', '104', 88.88, 'English', 'Технический английский'),
--('Тихонов Дмитрий Артемович', '102', 67.90, 'География', 'Физическая культура'),
--('Карлова Олеся Анатольевна', '103', 92.00, 'Математика', 'Информатика'),
--('Зайцева Алиса Сергеевна', '101', 75.55, 'Русский язык', 'Химия'),
--('Якубович Егоров Филиппович', '104', 99.99, 'Информатика', 'Астрономия'),
--('Борисов Владислав Игоревич', '102', 71.40, 'Литература', 'Философия'),
--('Семёнова Валерия Петровна', '103', 84.00, 'Биология', 'География'),
--('Остапенко Степан Геннадьевич', '101', 77.75, 'Дошкольное воспитание', 'Народное творчество'),
--('Смирнов Артем Игоревич', '104', 83.25, 'Физика', 'Математика'),
--('Филимонова Лилия Романовна', '102', 82.00, 'История', 'Литература'),
--('Коваленко Проспер Сергей', '103', 89.50, 'География', 'Научная работа'),
--('Белоусова Валентина Викторовна', '104', 95.75, 'Астрономия', 'Дизайн'),
--('Егорова Нина Константиновна', '101', 68.80, 'Рисование', 'Математика');


